Revit 2025 API
CoordinatePlaneVisibility Enumeration
 Visibility settings for ReferencePoint element's coordinate reference planes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CoordinatePlaneVisibility
Public Enumeration CoordinatePlaneVisibility
public enum class CoordinatePlaneVisibility
type CoordinatePlaneVisibility
Members
Member name | Value | Description
Never | 0 |  Never visible.
WhenSelected | 1 |  Visible when selected.
Always | 2 |  Always Visible.
See Also
Reference
Autodesk.Revit.DB Namespace